app/controllers/patients_controller.rb

INSERT INTO "patients" ("first_name", "middle_name", "last_name", "date_of_birth", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["first_name", ""], ["middle_name", nil], ["last_name", ""], ["date_of_birth", nil], ["status", 0], ["created_at", "2024-04-22 08:49:46.024899"], ["updated_at", "2024-04-22 08:49:46.024899"]]
---
    def create
        @patient = Patient.new(patient_params)
        if @patient.save

UPDATE "patients" SET "last_name" = ?, "date_of_birth" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["last_name", "Wan"], ["date_of_birth", "1990-04-18"], ["updated_at", "2024-04-23 16:39:47.165042"], ["id", 39]]
---
    def update
        if @patient.update(patient_params)