api/app/controllers/addresses_controller.rb

    def create
        @address = @patient.addresses.build(address_params)
        if @address.save
---
INSERT INTO "addresses" ("patient_id", "line1", "line2", "city", "state", "zip", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def update
        if @address.update(address_params)
---
UPDATE "addresses" SET "country" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["country", "123123"], ["updated_at", "2024-04-22 08:53:16.502420"], ["id", 1]]

    def set_patient
        @patient = Patient.find(params[:patient_id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]

    def set_address
        @address = @patient.addresses.find(params[:id])
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."patient_id" = ? AND "addresses"."id" = ? LIMIT ?  [["patient_id", 37], ["id", 1], ["LIMIT", 1]]