api/app/controllers/custom_fields_controller.rb

    def set_patient
        @patient = Patient.find(params[:patient_id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]