api/app/controllers/custom_fields_controller.rb

INSERT INTO "custom_fields" ("name", "value", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", ""], ["value", ""], ["patient_id", 39], ["created_at", "2024-04-22 09:19:26.921854"], ["updated_at", "2024-04-22 09:19:26.921854"]]
---
    def create
        @custom_field = @patient.custom_fields.build(custom_field_params)
        if @custom_field.save

DELETE FROM "custom_fields" WHERE "custom_fields"."id" = ?  [["id", 1]]
---
    def destroy
        @custom_field.destroy

SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
---
    def set_patient
        @patient = Patient.find(params[:patient_id])

SELECT "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."patient_id" = ? AND "custom_fields"."id" = ? LIMIT ?  [["patient_id", 37], ["id", 1], ["LIMIT", 1]]
---
    def set_custom_field
        @custom_field = @patient.custom_fields.find(params[:id])